taskmanager/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
---
   public function authenticate()
{
    $model = new UserModel();
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    // Find user by username
    $user = $model->where('username', $username)->first();