taskmanager/app/Controllers/TaskController.php

    public function index()
    {
        if (!session()->get('user_logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Please log in.');
        }

        $model = new TaskModel();
        $data['tasks'] = $model->findAll();
---
SELECT *
FROM `tasks`

    public function edit($id)
    {
        if (!session()->get('user_logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Please log in.');
        }

        $model = new TaskModel();
        $task = $model->find($id);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '14'